[
    {
        "file_name": "file1",
        "tags": ["Genetic Variants", "Mutations", "Zygosity", "Intergenic", "Intronic"],
        "description": "This file contains information about genetic variants, their positions, effects, and zygosity.",
        "recommends": [
            {
                "chart_type": "Histogram",
                "chart_description": "Using file1.csv to generate a light-orange bar chart, using rows where Zygosity column is het. Aggregate data per 10Mb."
            },
            {
                "chart_type": "Heatmap",
                "chart_description": "A heatmap showing the density of different mutation effects across the genome, where the 'Position' column is used to plot and 'Effect' can be grouped for different mutation types."
            }
        ]
    },
    {
        "file_name": "file2",
        "tags": ["Genetic Variants", "Insertions", "Deletions", "Intronic", "Intergenic"],
        "description": "This file contains information about insertion and deletion variants, including their sequence, size, and genomic location.",
        "recommends": [
            {
                "chart_type": "Highlight",
                "chart_description": "Using file2.csv to generate a dark-green bar chart, using rows where Type column is Insertion and Validation_status column is not empty."
            },
            {
                "chart_type": "Stack",
                "chart_description": "A stacked track displaying the density of insertions and deletions at different genomic positions, with 'Start' and 'End' columns to determine the variant locations, and 'Type' used to stack the insertions and deletions."
            }
        ]
    },
    {
        "file_name": "file3",
        "tags": ["Genetic Rearrangements", "Duplications", "Deletions", "Inversions", "Translocations"],
        "description": "This file contains information about various genetic rearrangements, including duplications, deletions, inversions, and translocations, along with associated genomic locations and effects.",
        "recommends": [
            {
                "chart_type": "Chords",
                "chart_description": "Using file3.csv to generate purple connection lines, linking regions where Chromosome and Chromosome.1 columns have different values."
            },
            {
                "chart_type": "Heatmap",
                "chart_description": "A heatmap showing the frequency and distribution of different rearrangement types across the genome. The 'Position' and 'Position.1' columns can be used to locate the rearrangement sites, with 'Rearrangement type' for categorization."
            }
        ]
    },
    {
        "file_name": "file4",
        "tags": ["Genetic Variants", "Single Nucleotide Polymorphisms", "Missense", "Silent", "Nonsense"],
        "description": "This file contains information about single nucleotide polymorphisms (SNPs), their effects on genes, and the resulting amino acid changes.",
        "recommends": [
            {
                "chart_type": "Heatmap",
                "chart_description": "A heatmap showing the distribution and types of mutations, where 'Position' is used for locating mutations across the genome, and 'Effect' or 'Zygosity' can be used for categorization."
            },
            {
                "chart_type": "Stack",
                "chart_description": "A stacked track representing the occurrence of different mutation types (e.g., 'Missense', 'Silent', 'Nonsense') across the genome, with 'Position' used for genomic location and 'Effect' used for categorizing mutation types."
            }
        ]
    },
    {
        "file_name": "file5",
        "tags": ["Copy Number Variations", "Genomic Segments", "Chromosomal Regions", "Copy Number"],
        "description": "This file contains information about copy number variations (CNVs) across genomic segments, including chromosome IDs, start and end positions, number of bins, and copy number values.",
        "recommends": [
            {
                "chart_type": "Heatmap",
                "chart_description": "A heatmap displaying the distribution of copy number variations across genomic segments, using 'Start' and 'End' columns for positioning and 'Copy number' for intensity or categorization."
            },
            {
                "chart_type": "Highlight",
                "chart_description": "A track highlighting the genomic segments with copy number variations, where 'Start' and 'End' columns define the segment boundaries and 'Copy number' indicates the variation level."
            }
        ]
    },
    {
        "file_name": "file6",
        "tags": ["Genomic Regions", "Chromosomal Segments", "Structural Variants", "Genomic Intervals"],
        "description": "This file contains information about genomic intervals across different chromosomes, including chromosome IDs, start and end positions of the segments.",
        "recommends": [
            {
                "chart_type": "Highlight",
                "chart_description": "A track highlighting the genomic intervals across chromosomes, using 'Start' and 'End' columns to define the segment boundaries and 'id' to differentiate chromosomes."
            },
            {
                "chart_type": "Heatmap",
                "chart_description": "A heatmap showing the distribution and density of genomic intervals across chromosomes, with 'Start' and 'End' columns for positioning and 'id' for chromosome-specific categorization."
            }
        ]
    }
]